perfomance_test/login_performance.yml
config:
  target: "https://www.demoblaze.com"
  engines:
    playwright:
      # Optional: play with launch options (headless by default)
      launchOptions:
        headless: true
  processor: "./login.ts"
  phases:
    - duration: 30
      arrivalRate: 3
      name: Warm up
scenarios:
  - name: Login Performance
    engine: playwright
    testFunction: "loginFlow"